Revit 2027 API
ElectricalLoadClassification.Motor Property
 Indicates if this load classification is to be used for motors.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool Motor { get; }
Public ReadOnly Property Motor As Boolean
	Get
public:
property bool Motor {
	bool get ();
}
member Motor : bool with get
Property Value
Boolean
See Also
Reference
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace